app/services/tokens_creator.rb

INSERT INTO "tokens" ("user_id", "token", "expired_in", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def call

    binding.pry

    encodet_token = JWT.encode @payload, nil, 'HS256'
    token = Token.create(
      user_id: @payload[:user_id],
      token: encodet_token,
      expired_in: @payload[:expired_in]
    )