app/controllers/items_controller.rb

INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "t_short"], ["description", "new_t_short_nike"], ["created_at", "2022-06-08 11:25:38.135428"], ["updated_at", "2022-06-08 11:25:38.135428"]]
---
  def create
    item = Item.new(item_params)

    if item.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "basket_items" ("item_id", "basket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 2], ["basket_id", 1], ["created_at", "2022-06-08 11:12:58.788833"], ["updated_at", "2022-06-08 11:12:58.788833"]]
---
  def add_to_basket
    current_user = User.find(params[:user_id])
    basket_item = BasketItem.new(basket_id: current_user.id, item_id: @item.id)

    if basket_item.save

UPDATE "items" SET "description" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["description", "new_t_short"], ["updated_at", "2022-06-08 11:52:36.500423"], ["id", 2]]
---
  def update
    if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 1]]
---
  def destroy
    if @item.destroy