app/controllers/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "baskets" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-06-30 18:07:12.312495"], ["updated_at", "2022-06-30 18:07:12.312495"], ["user_id", 2]]
---
  def create
    user = User.new(user_params)

    if user.save
      Basket.create(user_id: user.id)

UPDATE "users" SET "email" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "app@gmail.com"], ["encrypted_password", "$2a$12$RZXsBv2vI28M6i58CCdLnuWcHBInrua4FIdetLWVKiixktMc.tv16"], ["updated_at", "2022-06-30 18:14:43.421803"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by(id: params[:id])