app/controllers/concerns/access_handler.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def verify_information(user_info)
    user = User.find(user_info['user_id'])

SELECT "tokens".* FROM "tokens" WHERE "tokens"."token" = $1 LIMIT $2
---
  def token_valid?(token)
    token = Token.find_by(token: token)